[{"id":"9274813f-ceba-4654-a462-c4963e92c63a","slug":"semantyczny-html","title":"Wprowadzenie do Semantycznego HTML","description":"Semantyczny HTML polega na używaniu elementów HTML, które jednoznacznie opisują swoje znaczenie i cel. Elementy semantyczne nie tylko definiują strukturę dokumentu, ale również pomagają w interpretacji jego zawartości zarówno przez przeglądarki, jak i przez wyszukiwarki internetowe oraz technologie wspomagające (np. czytniki ekranowe).","keywords":["html","semantyka","seo","dostępność"],"categories":["html","seo"],"createdAt":"2024-07-05T00:00:00.000Z"},{"id":"8053f4f7-03df-4ff7-9d09-2180d65b4a1a","slug":"nowoczesny-javascript","title":"Renesans w JS, czyli nowoczesny JavaScript","description":"JavaScript jest językiem programowania, który jest powszechnie stosowany do tworzenia dynamicznych i interaktywnych stron internetowych. W ciągu ostatnich lat JavaScript znacznie ewoluował, wprowadzając nowe funkcje i poprawiając istniejące mechanizmy. W tym kursie omówimy najważniejsze elementy nowoczesnego JavaScript, w tym ES6 i nowsze.","keywords":["javascript","kurs","wprowadzenie","przewodnik","web","frontend"],"categories":["wprowadzenie","javascript"],"createdAt":"2024-06-30T00:00:00.000Z"},{"id":"87b17322-a557-4c9e-a353-a0f3ae147e78","slug":"szybszy-css-czyli-wprowadzenie-do-bem","title":"Wprowadzenie do metodyki BEM","description":"Czym jest BEM? BEM (Block, Element, Modifier) to metodyka nazewnictwa klas CSS, która pomaga tworzyć komponenty interfejsu użytkownika w sposób modularny i łatwy do utrzymania. BEM dzieli interfejs na bloki, elementy i modyfikatory, co pozwala na lepszą organizację kodu CSS.","keywords":["kurs","css","bem","metodyka","metodyki","stylowanie","html"],"categories":["wprowadzenie","css","html"],"createdAt":"2024-06-30T00:00:00.000Z"},{"id":"c007a2a7-a2e5-4160-bc40-2da8619cc8ce","slug":"wprowadzenie-do-css","title":"Wprowadzenie do CSS","description":"CSS (Cascading Style Sheets) to język służący do opisywania wyglądu i formatu dokumentu HTML. CSS pozwala na oddzielenie treści od prezentacji, co umożliwia tworzenie estetycznych i spójnych stron internetowych. W tym kursie omówimy podstawy CSS, w tym selektory, właściwości, sposoby załączania CSS do HTML oraz JavaScript, a także przedstawimy kilka zadań do wykonania.","keywords":["css","html","kurs","wprowadzenie","przewodnik","web","frontend"],"categories":["wprowadzenie","css"],"createdAt":"2024-06-30T00:00:00.000Z"},{"id":"522f1656-8196-4fed-93c7-23455278d178","slug":"wprowadzenie-do-dom","title":"Czym jest DOM?","description":"Czym jest DOM? DOM (Document Object Model) to interfejs programistyczny dla dokumentów HTML i XML. Umożliwia dynamiczne manipulowanie strukturą, stylem i treścią dokumentów. DOM reprezentuje dokument jako drzewo obiektów, gdzie każdy element, atrybut i tekst w dokumencie jest węzłem drzewa.","keywords":["kurs","html","dom","struktura","wprowadzenie"],"categories":["wprowadzenie","html"],"createdAt":"2024-06-30T00:00:00.000Z"},{"id":"ec7a95ec-9446-4db8-8c14-2357cd4555d4","slug":"wprowadzenie-do-html","title":"Wprowadzenie do HTML","description":"Co to jest HTML? HTML (HyperText Markup Language) to podstawowy język wykorzystywany do tworzenia i strukturyzowania stron internetowych. HTML używa elementów, które definiują różne części dokumentu, takie jak nagłówki, akapity, linki, obrazy, i wiele innych.","keywords":["kurs","html","dom","struktura","wprowadzenie"],"categories":["wprowadzenie","html"],"createdAt":"2024-06-30T00:00:00.000Z"},{"id":"f974dd33-9295-4cb8-bc97-84041f276677","slug":"wprowadzenie-do-javascript","title":"Wprowadzenie do JavaScript","description":"JavaScript jest językiem programowania, który jest powszechnie stosowany do tworzenia dynamicznych i interaktywnych stron internetowych. W tym kursie omówimy podstawy JavaScript, w tym zmienne, typy danych, operatory, struktury kontrolne, funkcje oraz obiekty.","keywords":["javascript","kurs","wprowadzenie","przewodnik","web","frontend"],"categories":["wprowadzenie","javascript"],"createdAt":"2024-06-30T00:00:00.000Z"}]