[{"id":"619434ce-27ed-4c4c-a9a5-a8f121d6649b","slug":"dependency-injection-kontra-typescript","title":"Szczepienie kodu, czyli jak Typescript radzi sobie z Dependency Injection","description":"Dependency Injection (DI) to wzorzec projektowy stosowany w celu zwiększenia modularności i testowalności kodu. Umożliwia to oddzielenie tworzenia obiektów od ich używania, co prowadzi do lepszej separacji odpowiedzialności i łatwiejszego zarządzania zależnościami. W TypeScript, DI można zaimplementować na kilka sposobów, w tym za pomocą kontenerów IoC (Inversion of Control), które są odpowiedzialne za tworzenie i wstrzykiwanie zależności. Przyjrzyjmy się, jak można zaimplementować DI w TypeScript z wykorzystaniem prostych przykładów.","keywords":["typescript","wzorce","javascript"],"categories":["typescript","wzorce"],"createdAt":"2024-06-20T00:00:00.000Z"},{"id":"5bcf2506-7faf-44a1-a304-c367bedb3f41","slug":"obserwatorium-czyli-wzorzec-projektowy-obserwatora","title":"Obserwatorium, czyli wzorzec projektowy obserwatora","description":"Wzorzec projektowy Obserwator (ang. Observer) jest jednym z najważniejszych wzorców projektowych, szczególnie użytecznym w kontekście programowania reaktywnego i aplikacji, które muszą reagować na zmiany stanu. W TypeScript możemy zaimplementować ten wzorzec w sposób typowany, co dodatkowo zwiększa bezpieczeństwo i czytelność kodu.","keywords":["typescript","wzorce","programowanie"],"categories":["typescript","wzorce"],"createdAt":"2024-06-20T00:00:00.000Z"},{"id":"1e502045-a6c1-43ca-9276-ce057c4b7cb6","slug":"signalizacja-czyli-koncept-signals-w-typescript","title":"Signalizacja, czyli koncept Signals w Typescript","description":"Signal to koncepcja pochodząca z programowania reaktywnego, której celem jest uproszczenie komunikacji między komponentami oraz zarządzania stanem aplikacji. W TypeScript, dzięki silnemu typowaniu, można zaimplementować sygnały w sposób bezpieczny i efektywny.","keywords":["typescript","wzorce","signals"],"categories":["typescript","wzorce"],"createdAt":"2024-06-20T00:00:00.000Z"}]